app/controllers/activities_controller.rb

SELECT "activities".* FROM "activities"
---
  def index
    p '***********************'
    activities = Activity.all