app/controllers/users_controller.rb

SELECT  "users".* FROM "users"  WHERE "users"."id" = 5  ORDER BY "users"."id" ASC LIMIT 1
SELECT "activities".* FROM "activities"
SELECT SUM("scores"."value") AS sum_id FROM "scores"  WHERE "scores"."user_id" = $1  [["user_id", 1]]
---
  def show
    @user = User.find(params[:id])
    @players = User.players
    @score = Score.new
    @activities = Activity.all
    @scores = []

    @players.each do |player|
      players_hash = {
        "name" => player.firstname,
        "photo" => photo_path(player.firstname),
        "scores" => player.scores.map {|score| {
          "id" => score.id,
          "value" => score.value,
          "challenge" => Activity.challenges.find(score.activity_id).id